# MSup2PerKN Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..MSup2PerKN Property
SymbolTypeId Class See Also
---
Symbol m²/kN, indicating unit Square meters per kilonewton.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MSup2PerKN { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MSup2PerKN As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MSup2PerKN {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace